class AddressGenerator {
    constructor() {
        this.regions = {
            '서울특별시': {
                "종로구":['자하문로','인사동길','종로','우정국로','율곡로','세종대로','삼청로','대학로'],   
                "중구":['다산로','마른내로', '무교로','퇴계로','을지로','소공로','명동길'],     
                "용산구":['이태원로', '한강대로','후암로', '한남대로','이촌로','신흥로'],   
                "성동구":['왕십리로','성수이로','서울숲','연무장길','뚝섬로'],   
                "광진구":['영화사로', '워커힐로','군자로','뚝섬로','능동로'],   
                "동대문구":['신이문로', '하정로','왕산로','회기로','천호대로'], 
                "중랑구":['용마산로','면목로','봉화산로','망우로','상봉로','중랑천로'],
                "성북구":['성북로','동소문로','길음로','월곡로','정릉로'],
                "강북구":['오패산로','도봉로','삼양로','번동로','화계로'],
                "도봉구":['도봉로','방학로','창동로','쌍문로','도봉산로'],
                "노원구":['노해로','중계로','공릉로','노원로','월계로'],
                "은평구":['통일로','연서로','불광로','역촌로','증산로'],
                "서대문구":['연세로','통일로','신촌로','연희로','가좌로'],
                "마포구":['양화로','월드컵로','마포대로','신촌로','망원로','서강로'],   
                "양천구":['목동로','신정로','오목로','양천로','목동동로'],
                "강서구":['공항대로','화곡로','등촌로','양천로','가양로'],
                "구로구":['구로중앙로','오리로','천왕로','경인로','디지털로'],
                "금천구":['시흥대로','독산로','금하로','가산로','벤처로'],
                "영등포구":['국회대로','여의대로','문래로','양평로','당산로'], 
                "동작구":['동작대로','보라매로','상도로','흑석로','노량진로'],
                "관악구":['관악로','남부순환로','보라매로','봉천로','낙성대로'],
                "서초구":['서초대로','반포대로','방배로','남부순환로','언남로'],   
                "강남구":['테헤란로','밤고개로','언주로','양재대로','압구정로','논현로'],   
                "송파구":['잠실로','송파대로','오금로','중대로','백제고분로'],   
                "강동구":['천호대로','양재대로','성내로','강동대로']   
            },
            '부산광역시': {
                '해운대구':['해운대로','달맞이길','재송로','중동로','좌동로'],
                '부산진구':['서면로','가야대로','전포대로','범천로','부전로'],
                '동래구':['동래로','충렬대로','온천천로','명륜로','수안로'],
                '연제구':['연제로','거제대로','거제중앙로','연산로','거제동로'],
                '남구':['대연로','문현로','암남공원로','용호로','감만로'],
            },
            '대구광역시': {
                '중구':['달구벌대로','중앙대로','청라로','남성로','서성로'],
                '수성구':['달구벌대로','범어로','신매로','동대구로','만촌로'],
                '북구':['칠곡로','검단로','동북로','국우로','침산로'],
                '달서구':['와룡로','성서로','달구벌대로','두류로','본리로'],
                '남구':['문산로','앞산순환로','대명로','봉덕로','앞산로'],
            },
            '인천광역시': {
                '남동구':['인주대로','남동대로','산곡로','만수로','구월로'],
                '연수구':['송도과학로','센트럴로','청능대로','연수로','해돋이로'],
                '남구':['남항로','인하로','경인로','문학로','주안로'],
                '부평구':['부평대로','부평로','갈산로','부흥로','삼산로'],
                '서구':['가좌로','청라로','검암로','경인로','원당대로'],
            },
            '광주광역시': {
                '동구':['동명로','충장로','무등로','계림로','금남로'],
                '서구':['치평로','금호로','화정로','광천로','상무대로'],
                '남구':['백서로','봉선로','주월로','양림로','진월로'],
                '북구':['문화로','임방울대로','중흥로','두암로','우산로'],
                '광산구':['첨단로','수완로','비아로','평동로','신가로'],
            },
            '대전광역시': {
                '동구':['동서대로','중앙로','판암로','자양로','가양로'],
                '중구':['중앙로','선화로','대흥로','문화로','은행동로'],
                '서구':['둔산로','관저로','탄방로','문정로','용문로'],
                '유성구':['유성대로','노은로','가정로','궁동로','원신흥로'],
                '대덕구':['송촌로','법동로','대덕대로','신탄진로','오정로'],
            },
            '울산광역시': {
                '중구':['삼산로','문화로','중앙로','성남로','옥교로'],
                '남구':['삼산로','달동로','신정로','선암로','선암남로'],
                '동구':['화정로','일산로','방어진로','방어진순환로','동구로'],
                '북구':['산업로','진장로', '신천대로', '복산로','화봉로'],
                '울주군':['언양로','삼남로','온산로','범서로','상북로'],
            },
        }
    }

    pickRandomInObject(arr) {
        let randomIndex = Math.floor(Math.random() * Object.keys(arr).length);
        //console.log(randomIndex);
        const keys = Object.keys(arr);
        return keys[randomIndex];
    }

    pickRandomInArray(arr){
        return arr[Math.floor(Math.random() * arr.length)];
    }

    makeRandomRoadNumber(){
        return Math.floor(Math.random() * 150) + 1
    }

    makeRandomAddress(){
        let fullAddress = '';
        //시를 뽑는다
        let city = this.pickRandomInObject(this.regions);
        //console.log(city);

        //구를 뽑는다
        let guCandidates = this.regions[city];
        let gu = this.pickRandomInObject(guCandidates);
        //console.log(gu);

        //로를 뽑는다
        let roadCandidates = this.regions[city][gu];
        console.log(roadCandidates);
        let road = this.pickRandomInArray(roadCandidates);
        //console.log(road);

        //도로 넘버를 만든다
        let roadNumber = this.makeRandomRoadNumber();
        //console.log(roadNumber);

        fullAddress = `${city} ${gu} ${road} ${roadNumber}`;
        //console.log(fullAddress);
    }
}

export default AddressGenerator;