class Address {
    makeRandomAddress() {
        const region = {
            '서울특별시': {
                "종로구":['자하문로','인사동길','종로','우정국로','율곡로','세종대로','삼청로','대학로'],   
                "중구":['다산로','마른내로', '무교로','퇴계로','을지로','소공로','명동길'],     
                "용산구":['이태원로', '한강대로','후암로', '한남대로','이촌로','신흥로'],   
                "성동구":['왕십리로','성수이로','서울숲','연무장길','뚝섬로'],   
                "광진구":['영화사로', '워커힐로','군자로','뚝섬로','능동로'],   
                "동대문구":['신이문로', '하정로','왕산로','회기로','천호대로'], 
                "중랑구",
                "성북구",
                "강북구",
                "도봉구",
                "노원구",
                "은평구",
                "서대문구",
                "마포구",   
                "양천구",
                "강서구",
                "구로구",
                "금천구",
                "영등포구", 
                "동작구",
                "관악구",
                "서초구",   
                "강남구",   
                "송파구",   
                "강동구"    
            },
            '부산광역시': {},
            '대구광역시': {},
            '인천광역시': {},
            '광주광역시': {},
            '대전광역시': {},
            '울산광역시': {},
        }
    }
}